Repository: mpassid/MPASSid-connect
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

source: Finnish
fi: Suomi

source: English
fi: Englanti

source: Token
fi: Rekisteröintikoodi

source: Password
fi: Salasana

source: Please enter a correct %(username)s and password. Note that both fields may be case-sensitive.
fi: Syötä oikea %(username)s ja salasana. Huomaa että molemmat kentät voivatsisältää isoja kirjaimia.

source: This account is inactive.
fi: Tämä tili ei ole aktiivinen.

source: A user with that username already exists.
fi: Tällä nimellä on jo olemassa käyttäjätili.

source: The two password fields didn't match.
fi: Salasanakentät eivät täsmää.

source: Username
fi: Käyttäjätunnus

source: Required. 2048 characters or fewer. Letters, digits and @/./+/-/_ only.
fi: Vaaditaan. 2048 merkkiä tai vähemmän. Ainoastaan kirjaimia, numeroita ja @/./+/-/_

source: This value may contain only letters, numbers and @/./+/-/_ characters.
fi: Tämä arvo voi sisältää ainoastaan kirjaimia, numeroita tai merkkejä @/./+/-/_.

source: username
fi: käyttäjätunnus

source: Enter a valid username.
fi: Syötä hyväksyttävä käyttäjätunnus.

source: first name
fi: etunimi

source: last name
fi: sukunimi

source: email address
fi: sähköpostiosoite

source: Association failed
fi: Kirjautumistavan lisäys epäonnistui

source: There was some problem with your token, authentication server or data service.
fi: Rekisteröintikutsussasi, kirjautumispalvelussa tai tietopalvelussa oli ongelma.

source: Service association success
fi: Kirjautumispalvelu on liitetty onnistuneesti

source: Your authentication service was successfully associated. You may now log in using the service.
fi: Kirjautumispalvelu on liitetty tiliisi onnistuneesti. Voit nyt kirjautua sisään liitetyn palvelun avulla.

source: Associating services
fi: Tunnistusvälineiden liittäminen

source: MPASS takes care of secure authentication using the accounts of other supported services. This is a safe way for you, as you do not need to tell MPASS any of the passwords to your existing services, but you can still use them for login.
fi: MPASS huolehtii turvallisesta tunnistautumisesta tuettujen tunnistuslähteiden tunnuksilla. Näin sinun ei tarvitse kertoa MPASSille näiden tunnuksiesi salasanoja, mutta voit silti hyödyntää niitä sisäänkirjautumisessa.

source: Press Continue and select a service of your choice. If you are not already logged in to the service, it requests you to log in. Then the service may confirm from you what you allow MPASS to do with your information. After this, you have associated the service, and can use it from now on for login!
fi: Paina Jatka ja valitse haluamasi tunnistustapa listalta. Jos et ole jo kirjautuneena, palvelu pyytää sinua kirjautumaan sisään. Palvelu saattaa vielä varmistaa sinulta, mitä MPASSilla on lupa tehdä tiedoillasi. Tämän jälkeen olet liittänyt kyseisen palvelun ja voit käyttää sitä jatkossa kirjautumiseen!

source: Continue
fi: Jatka

source: Educloud Alliance Connector Service
fi: MPASS tunnistusvälineiden hallinta

source: Search
fi: Hae

source: Invite
fi: Kutsu

source: Profile
fi: Profiili

source: Register
fi: Rekisteröidy

source: Log in
fi: Kirjaudu

source: Connector
fi: Tunnistusvälineiden hallinta

source: MPASS Connector service for inviting and registering new users.
fi: MPASS tunnistusvälineiden hallinta on palvelu jonka avulla voi kutsua ja rekisteröidä uusia käyttäjiä.

source: Learn more about MPASS
fi: Lue lisää MPASSista

source: Invitator
fi: Kutsuja

source: Invitator invites new users to the system by acting as trusted party and identifying the user.
fi: Kutsuja kutsuu uusia käyttäjiä järjestelmään toimimalla luotettavana tahona ja tunnistamalla käyttäjän.

source: Invitee search
fi: Kutsuttavan haku

source: Send registration tokens
fi: Lähetä rekisteröintikutsu

source: Invitee
fi: Uusi käyttäjä

source: Invitee joins the system by authenticating with some auth source and using the registration token acquired by invitator.
fi: Uusi käyttäjä liittyy järjestelmään tunnistautumalla jonkin tunnistuspalvelun avulla ja käyttämällä kutsujan toimittamaa rekisteröintikutsua.

source: Use registration token
fi: Rekisteröidy

source: Municipality
fi: Kunta

source: School
fi: Koulu

source: Role
fi: Rooli

source: Group
fi: Ryhmä

source: No users were found
fi: Käyttäjiä ei löytynyt

source: Invite users
fi: Kutsu käyttäjiä

source: Your previous search result is remembered and you can select to which users you would like to send invitation tokens.
fi: Aikaisempi hakutuloksesti on muistissa ja voit valita käyttäjät joille haluat lähettää rekisteröintikutsut.

source: Invite successfull. Registration tokens have been sent for the users.
fi: Kutsu onnistui. Rekisteröintikutsut on lähetetty käyttäjille.

source: Here are the registration tokens, for debugging purposes:
fi: Tässä ovat rekisteröintikutsut virheentarkistusta varten:

source: #mepin-auth-info-1
fi: MePIN on mobiilisovellus, jonka avulla voit kirjautua turvallisesti sitä tukeviin palveluihin. Voit liittää MePIN-sovelluksen helposti oppijan avaimeen jonka jälkeen kirjautumiset voi varmistaa ilman salasanoja.

source: #mepin-auth-info-2
fi: MePIN toimii Android- ja iOS-laitteissa. Laitteestasi riippuen asenna MePIN-sovellus Appstoresta tai Google Playsta ja siirry sen jälkeen eteenpäin.

source: Start association
fi: Aloita liittäminen

source: Permission denied
fi: Lupa evätty

source: You need to have permissions to access any other than registration token page.
fi: Sinulla täytyy olla lupa kutsujen lähettämiseen.

source: My authentication methods
fi: Minun tunnistusvälineeni

source: Attribute name
fi: Tunnistusvälineen nimi

source: Attribute value
fi: Tunnisteen arvo

source: Remove
fi: Poista

source: Are you sure you want delete attribute
fi: Oletko varma että haluat poistaa tunnistautumistavan

source: Add other association
fi: Liitä muita tunnistusvälineitä

source: Add MePIN association
fi: Liitä Oppijan Avain

source: Close
fi: Sulje

source: MePIN
fi: Oppijan Avain

source: Register with token
fi: Rekisteröityminen

source: You've received registration token. Enter it below.
fi: Olet saanut rekisteröintikutsun ja sinulle on lähetetty rekisteröintikoodi. Syötä saamasi rekisteröintikoodi alle.

source: Registration failed
fi: Rekisteröinti epäonnistui

source: There was some problem with your token.
fi: Kutsussasi oli ongelma.

source: Registration success
fi: Rekisteröinti onnistui

source: The registration was successful.
fi: Olet rekisteröitynyt palveluun onnistuneesti.

source: Search for users
fi: Etsi käyttäjiä

source: You can search for users in Role Database by school and group name. When you are satisfied with the search results you can select to which users you would like to send invitation tokens.
fi: Voit etsiä käyttäjiä kunnan, koulun ja ryhmän nimillä. Kun olet tyytyväinen hakutuloksiin voit valita mille käyttäjille haluat lähettää kutsun.
